POSTGRES
#разработан в академической среде, под руководством Майкла Стоунбрейкера(Michael Stonebraker) - профессора Калифорнийского в Беркли, также возглавлявшего разработку INGRESS как результат осмысления предыдущей работы, для преодоления ограниченности жесткой сис-мы типов
#Разработка началась в 1985, до 1988 был опубликован ряд научных статей описывающих модель данных, язык запросов POSTQUEL(тогда sql еще не был общепризнан) и устройство хранилища данных
#иногда относят к постреляционным субд
#первая версия появилась в 1989 и совершенствовалась на протяжении нескольких лет, в 1993 появиаась версия 4.2, проект был закрыт, opensource и bsd лицензия позволили выпускникам Беркли Эндрю Ю и Джоли Чену в 1994 продолжить его разработку, заменили POSTQUEL на SQL, и переименовали проект в Postgres95, в 1996 стало ясно что название не выдержит испытание временем и было заменено на PostgreSQL(postgre+sql) 6.0 продолжая исходную нумерацию
