asyncio

    aiohttp

    gevent

        requests



Рефакторинг.
    Ветвление.
        Карта Карно.



os?



Процессы/потоки?



Примеры использования v env?



Aбстрактные [базовые] классы?



__all__



Monkey patching?



Как писать файлы на диск надежно?



Как правильно получить путь к desktop?
#лучше чем 
    user_profile_path = os.getenv('USERPROFILE')
    user_desktop_path = os.path.join(user_profile_path, 'desktop')



Как обойти gil?



Как показать в help норм заголовок if fx принимает *args?



Как посчитать все заглавные буквы в очень большом файле?



Как хранить ключи не в репе?



Проверить все комменты в репе на грамматику.



Вывод табличных данных?
#пример вывести в консоль два столбца из os.environ


Спросить что подтянуть


проверить резюме на qna


что за пиздец в contribution github?