asyncio
    aiohttp
    gevent
        requests
рефакторинг
    ветвление
        карта карно
os
процессы/потоки
переменные окружения
абстрактные [базовые] классы
__all__
cross join vs inner join vs join
monkey patching
как писать файлы на диск надежно?
#временный файл?
outer join
#на примере
как разбираться в структуре больших бд
#проверить aviacompany в datagrip

посчитать все заглавные буквы в очень большом файле

как хранить ключи не в репе

проверить все комменты в репе на грамматику

декоратор класса