server\
#serve-облуживание


submarinacablemap.com
#карта подводных кабелей


cli
#command line interface/prompt - текстовое приложение


CLOUDS IDE
    https://paiza.cloud/
    https://aws.amazon.com/cloud9/


dunder
#from double underscore


МЕТАДАННЫЕ
#лат meta - цель, конечный пункт, предел, край, данные
#информация о информации/доп информация о содержимом|obj
#позволяет искать/управлять сущностями в больших информационных потоках
#структурированные в виде иерархии - онтология|схема метаданных, напр
	XML-схема
	

ИДЕМПОТЕНТНОСТЬ
#свво obj|операции давать тот-же результат при повторном применении