 селекторы
#выбор форматируемых эл-тов
	СЕЛЕКТОРЫ ТЕГОВ
	КЛАССЫ
	#точное управление
	ИДЕНТИФИКАТОРЫ
	#отдельные эл-ты
	ФОРМАТИРОВАНИЕ ГРУПП ЭЛ-ТОВ
	ФОРМАТИРОВАНИЕ ВЛОЖЕННЫХ ЭЛ-ТОВ
	ПСЕВДОКЛАССЫ
	ПСЕВДОЭЛ-ТЫ
	СЕЛЕКТОРЫ АТРИБУТОВ
	ДОЧЕРНИЕ СЕЛЕКТОРЫ
	РОДСТВЕННЫЕ СЕЛЕКТОРЫ
	СЕЛЕКТОР :target
	СЕЛЕКТОР :not()
 механизм наследования стилей
	ОГРАНИЧЕНИЯ НАСЛЕДОВАНИЯ
 управление сложной структурой стилей
	каскадность
	ОСОБЕННОСТИ КАСКАДНОСТИ
	#какие стили ⊃ преимущество
ТАБЛИЦЫ СТИЛЕЙ
	ВНУТРЕННИЕ
	ВНЕШНИЕ

ПРИМЕНЕНИЕ CSS
	ФОРМАТИРОВАНИЕ ТЕКСТА
		шрифты
		веб-шрифты
		Google Fonts
		#служба
	ПОЛЯ, ОТСТУПЫ, ГРАНИЦЫ
		БЛОЧНАЯ МОДЕЛЬ
	ДОБАВЛЕНИЕ ГРАФИКИ
		<img>
		СОКРАЩЕННАЯ ЗАПИСЬ СВ-ВА background
		МНОЖЕСТВЕННЫЕ ФОНЫ
	ПОСТРОЕНИЕ НАВИГАЦИОННОЙ СИС-МЫ САЙТА
		ВЫБОРКА ФОРМАТИРУЕМЫХ ССЫЛОК
		ФОРМАТИРОВАНИЕ ССЫЛОК
		РОЛЛОВЕР
	ПРЕОБРАЗОВАНИЯ
	ПЕРЕХОДЫ
	АНИМАЦИЯ
	ФОРМАТИРОВАНИЕ ТАБЛИЦ И ВЕБ-ФОРМ
ТИПЫ МАКЕТОВ
СТРАТЕГИИ ВЕРСТКИ
МНОГОКОЛОНОЧНЫЕ МАКЕТЫ
ПРИНЦИПЫ РАБОТЫ СВ-В ПОЗИЦИОНИРОВАНИЯ
ЭФФЕКТИВНЫЕ СТРАТЕГИИ ПОЗИЦИОНИРОВАНИЯ
МАКЕТЫ НА ОСНОВЕ ОБТЕКАЕМЫХ ЭЛ-ТОВ
ПОЗИЦИОНИРОВАНИЕ ЭЛ-ТОВ
	ОТЛИЧНЫЕ ОТ АБСОЛЮТНОГО И ОТНОСИТЕЛЬНОГО?
СХЕМЫ ДИЗАЙНА
АДАПТИВНЫЙ ДИЗАЙН
	МЕДИАЗАПРОСЫ
	ГИБКИЕ СЕТКИ
	ГИБКИЕ ИЗОБРАЖЕНИЯ
Skeleton
#сис-ма модульной верстки(сетки)
	СТРУКТУРИРОВАНИЕ HTML ПОД МОДУЛЬНУЮ СЕТКУ
	СОЗДАНИЕ И ИМЕНОВАНИЕ КОЛОНОК
flexbox-верстка
#метод создания макета
	СВ-ВА flex-контейнера
	СВ-ВА flex-элтов
Sass
	ИНТЕГРАЦИЯ SASS
	ФРАГМЕНТЫ SASS
	ВЛОЖЕННЫЕ СЕЛЕКТОРЫ
	НАСЛЕДОВАНИЕ/РАСШИРЕНИЕ СВ-В
	ПРИМЕСИ
	МЕДИАЗАПРОСЫ
	КАРТЫ CSS-кода
	#исп для поиска и устранения err
ТИПЫ ДОКУМЕНТОВ
УСТРАНЕНИЯ КОНФЛИКТОВ СТИЛЕЙ
ИСП СЕЛЕКТОРОВ ПОТОМКОВ
СВ-ВА CSS
	СВ-ВА СПИСКОВ
	КОМПОНОВКА МАКЕТА