рассматривание вещей еще не включенных в стандарт ES6,ES7,...
#на момент написания книги es6 почти готов
 js унаследовал 
	от C многие программные конструкции
	от Scheme/Lisp принципы fx-программирования
многие примеры в книге расчитаны на современные и будущие реализации js вроде es6
дополнения к книге: http://bit.ly/ydkjs-es6beyound-code
коллекции
#структура данных
#ES6+
новые возможности обработки и API
destructuring
#деструктурирование
#новая возможность js
значения по умолчанию
#ES6+
символы
#новая возможность js
#тип данных?
concise methods
#сокращенные методы
#новая возможность js
вычисляемые св-ва
#новая возможность js
arrow fx
#стрелочные fx
итераторы
#
модули
#
прокси
#
weakmaps
#слабосвязанные коллекции key-val