поковырять параметры моделеи
#что пишется в бд, как с этим работать


проверить поля в шаблоне при сохранении


future
	отследить поток данных из формы -> МОЖНО ИСП ORM & ТУПОИ ПРОСМОТР БД
	#да по сути он исп ORM -> нет особого смысла в этом разбираться
	
	что происходит при указании UNIQUE в бд?
	#проверить на примере параметров полеи модели
		unique
		unique_for_date
		unique_for_month
		unique_for_year
	
	просмотреть http запрос
	#не особо понял как это сделать -> firefox не отобразил POST запрос ->
		попробовать chrome?
		может это делает сам dj?(~подключению jupyter?)
		исп pycharm?

		
	exe сайты djgirls и dronov еще раз
	#на данныи момент не имею достаточно данных


	возможно нужно перенести описания валидации(стандартнои) полей в валидаторы
	
	
	как просмотреть историю запросов разных бд
		sqlite -> можно через консоль, но требует соответствующих познании