КОММЕНТАРИИ ДЛЯ СЕБЯ


РАБОТА С МЕТКАМИ?


ПСЕВДОНИМЫ?


ПРОТОКОЛЫ?


УСТАНОВКА GIT НА СЕРВЕР?


ГЕНЕРАЦИЯ ОТКРЫТОГО SSH КЛЮЧА?


УМНЫЙ HTTP?


GitWeb?


GitLab?


Git-хостинг?


Распределенный рабочий процесс?


Scripting GitHub?


Инструменты Git?

	Выбор ревизии?

	Интерактивное индексирование?

	Прибережение и очистка?

	Подпись результатов работы?

	Исправление истории?

	Продвинутое слияние?

	Rerere?

	Обнаружение ошибок?

	Подмодули?

	Создание пакетов?

	Замена?

	Хранилище учетных данных?


конфигурация Git?


атрибуты git?


git hooks?


Git-Enforced Policy?


Git как клиент?


Миграция на git?


объекты git?


ссылки в git?


pack-файлы?


спецификации ссылок?


протоколы передачи данных?


уход за репозиторием и восстановление данных?


переменные среды?


встраивание git в приложения?

	Libgit2?

	JGit?

	go-git?

	Dulwich?


Команды git?

	настройка и конфигурация?

	Клонирование и создание реп?

	работа с помощью email?

	внешние сис-мы?

	Администрирование?

	Низкоуровневые команды?