 API?
	Array?
	Object?
	Math?
	Number?
	String?
мета-программирование?
#расширяет функционал программ?
	Имена fx?
	метасв-ва?
	известные символы?
	прокси?
	Reflect API?
	тестирование fx-особенностей?
	оптимизация хвостовой рекурсии?
ES
	транскомпиляция?
СИНТАКСИС
	объявления на уровне блоков кода?
	операторы
		Spread?
		Rest?
	деструктурирующее присваивание?
	расширение obj литералов?
	шаблонные строки?
	стрелочные fx?
	цикл for..of?
	расширение числовых литералов?
	тип данных Symbol?
УПРАВЛЕНИЕ АСИНХРОННЫМИ ОПЕРАЦИЯМИ?
	обещания(promise?)?
	генераторы и обещания?
КОЛЛЕКЦИИ
	TypedArrays?
	карты?
	WeakMap obj?
	Set obj?
	WeakSets?
ДОПОЛНЕНИЯ К API?
	массив?
	obj?
	obj Math?
	obj Number?
	obj String?
ЗА ПРЕДЕЛАМИ ES6?
	async fx?
	метод Object.observe(..)?
	Оператор возведения в степень
	св-ва obj и оператор?
	метод Array#includes(..)?
	принцип SIMD?
	язык WebAssembly(WASM)?
передача fx в виде обратных вызовов?