тестирования приложения в контейнере?

сопровождение крупной сис-мы с мн-вом хостов в сетевой среде со сложным режимом планирования?

дополнительные модули и надстройки?

работа с реестрамио?
    закрытые частные репы?
хостинг для docker?

контекст создания образа?

кеширование?

базовые образы?

связь контейнеров с внешним миром vs соединение между контейнерами?

управление данными с помощью томов и контейнеров данных?

использование преимуществ существующих изображений?

дополнительное кеширование?

микросервисы?

docker hub?

автоматические сборки?

распространение с ограничением доступа?
    организация собственного реестра?
    коммерческие реестры?

сокращение размера образа?

происхождение образа?

непрерывная интеграция и тестирование с использованием docker?

включение модульных тестов в identidock?

создание контейнера для сервера Jenkins?
    создание образа по триггеру?

выгрузка образа в реестр?
    присваивание осмысленных тегов?e
    конечные процедуры подготовки и эксплуатации?
    беспорядочный рост числа образов?
    использование docker для поддержки вспомогательных серверов Jenkins?
организация резервного копирования для сервера Jenkins?
хостинги для непрерывной интеграции?
тестирование и микросервисы, тестирование во время эксплуатации?